using System;

namespace BasicListExample
{
    /*
     Создать список состоящий из пяти элементов - 8, 6, 1, 40, 55
        - Извлечь из списка второй элемент (6)
        - Вставить на третье место элемент 155 (список будет 8, 6, 155, 1, 40, 55)
        - Найти индекс элемента 1 и 40
        - Удалить элемент 155
        - Удалить третий элемент
        - Отсортировать список и вывести на экран
        - Найти индекс элемента 55 с помощью бинарного поиска
     */
    class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}
