using System;

namespace Example2
{
    class Program
    {
        /*
         Создать словарь для хранения пар ИНН - ФИО. 
            - Добавить несколько пар ключ-значение
            - Изменить значение 
            - Попробовать добавить ИНН, который уже есть
            - Осуществить поиск по определенному ИНН
            - Вывести на экран все пары
         */
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
