using System;

namespace Example4
{
    /*
     Считать содержимое текстового файла и вывести его на экран
        Вывести на экран слова которые начинаются на букву “a”
        Вывести на экран слова которые заканчиваются на букву “я”
     */
    class Program
    {
        
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
