using System;

namespace Example1
{
    /*
     Создать строку содержащую escape-последовательность табуляцию и перенос строки
     */
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
