using System;

namespace Example3
{
    /*
     Написать программу телефонную книгу. 
     Пользователь вводит имя человека и телефон, пока не нажмет ESC. 
     После ввода данных пользователь может найти номер телефона по имени человека
     */
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
